app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT `questions`.* FROM `questions`

  def show
    @question = Question.find(params[:id])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1

  def new
    @question = Question.new
    @sub_sections = SubSection.all
---
SELECT `sub_sections`.* FROM `sub_sections`

  def edit
    @question = Question.find(params[:id])
    @sub_sections = SubSection.all
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
SELECT `sub_sections`.* FROM `sub_sections`

  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save
---
INSERT INTO `questions` (`created_at`, `description`, `question`, `status`, `sub_section_id`, `updated_at`) VALUES ('2012-10-10 09:54:33', 'Are all hardware and software for which the organization is responsible periodically inventoried?\r\nHave hardware and software that maintains or transmits EPHI been identified?\r\nIs the current information system configuration documented, including connections to other systems?\r\nHave the types of information and uses of that information been identified and the sensitivity of each type of information been evaluated? ', 'Have all relevant information systems been identified, documented, inventoried, and access to EPHI been determined? ', '', NULL, '2012-10-10 09:54:33')

  def update
    @question = Question.find(params[:id])

    respond_to do |format|
      if @question.update_attributes(params[:question])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
UPDATE `questions` SET `sub_section_id` = 2, `updated_at` = '2012-10-10 09:55:50' WHERE `questions`.`id` = 1