app/controllers/sub_sections_controller.rb

SELECT `sub_sections`.* FROM `sub_sections`
---
  def index
    @sub_sections = SubSection.all

SELECT `sub_sections`.* FROM `sub_sections` WHERE `sub_sections`.`id` = 1 LIMIT 1
---
  def show
    @sub_section = SubSection.find(params[:id])

SELECT `sections`.* FROM `sections`
---
  def new
    @sub_section = SubSection.new
    @sections = Section.all

SELECT `sub_sections`.* FROM `sub_sections` WHERE `sub_sections`.`id` = 1 LIMIT 1
SELECT `sections`.* FROM `sections`
---
  def edit
    @sub_section = SubSection.find(params[:id])
    @sections = Section.all

INSERT INTO `sub_sections` (`created_at`, `display_name`, `section_id`, `status`, `sub_section_name`, `updated_at`) VALUES ('2012-10-10 09:46:01', 'Security Management Process ', NULL, NULL, 'Security Management Process ', '2012-10-10 09:46:01')
---
  def create
    debugger
    @sub_section = SubSection.new(params[:sub_section])

    respond_to do |format|
      if @sub_section.save

SELECT `sub_sections`.* FROM `sub_sections` WHERE `sub_sections`.`id` = 1 LIMIT 1
DELETE FROM `sub_sections` WHERE `sub_sections`.`id` = 1
---
  def destroy
    @sub_section = SubSection.find(params[:id])
    @sub_section.destroy